archives/old_version/MTO/3Dheatsink/app/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (0.0 0.0 0)
    (0.4 0.0 0)
    (0.5 0.0 0)
    (0.0 0.05 0)
    (0.4 0.05 0)
    (0.5 0.05 0)  
    (0.0 0.2375 0)
    (0.4 0.2375 0)
    (0.5 0.2375 0)
    (0.0 0.25 0)
    (0.4 0.25 0)
    (0.5 0.25 0)
	   (0.0 0.0 1)
    (0.4 0.0 1)
    (0.5 0.0 1)
    (0.0 0.05 1)
    (0.4 0.05 1)
    (0.5 0.05 1)
    (0.0 0.2375 1)
    (0.4 0.2375 1)
    (0.5 0.2375 1)    
    (0.0 0.25 1)
    (0.4 0.25 1)
    (0.5 0.25 1)
    (0.4 0.0 -0.1)
    (0.5 0.0 -0.1)
    (0.4 0.05 -0.1)
    (0.5 0.05 -0.1)
    (0.4 0.0 1.1)
    (0.5 0.0 1.1)
    (0.4 0.05 1.1)
    (0.5 0.05 1.1)
);


blocks
(
    hex (0 1 4 3 12 13 16 15)
    (64 8 160)
    simpleGrading (1 1 1)
    
    hex (3 4 7 6 15 16 19 18)
    (64 30 160)
    simpleGrading (1 1 1)
    
    hex (1 2 5 4 13 14 17 16)
    //zone_flow
    (16 8 160)
    simpleGrading (1 1 1)
    
    hex (4 5 8 7 16 17 20 19)
    (16 30 160)
    simpleGrading (1 1 1)
    
    hex (6 7 10 9 18 19 22 21)
    zone_solid
    (64 2 160)
    simpleGrading (1 1 1)  
    
    hex (7 8 11 10 19 20 23 22)
    zone_solid
    (16 2 160)
    simpleGrading (1 1 1) 
          
    hex (24 25 27 26 1 2 5 4)
    zone_fluid
    (16 8 16)
    simpleGrading (1 1 1)
    
    hex (13 14 17 16 28 29 31 30)
    zone_fluid
    (16 8 16)
    simpleGrading (1 1 1)    
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (28 29 31 30)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (24 26 27 25)
        );
    }
    force
    {
        type patch;
        faces
        (
            (22 23 11 10)
            (21 22 10 9)
        );    
    }
	  wall
    {
        type patch;
        faces
        (
            (12 13 16 15)
            (15 16 19 18)
            (16 17 20 19)	
            (18 19 22 21)
            (19 20 23 22)
            (13 28 30 16)
            (16 30 31 17)
            (9 6 18 21)
            (6 3 15 18)	
            (3 0 12 15)
            (9 10 7 6)
            (10 11 8 7)
            (6 7 4 3)	
            (7 8 5 4)
            (3 4 1 0)            
            (1 4 26 24)	
            (4 5 27 26)	            		
        );
    }
    sym
    {
        type symmetry;
        faces
        (
            (14 17 31 29)
            (13 14 29 28)
            (2 5 17 14)
            (5 8 20 17)
            (8 11 23 20)
            (13 12 0 1)
            (14 13 1 2)
            (25 27 5 2)
            (1 24 25 2)           
        );
    }
);
mergePatchPairs
(
);

// ************************************************************************* //
